# Завдання 3. Варіант 8
# Розбиття списку на два списки за вказаним порядковим номером елемента

def split_list():
    A = list(map(int, input("Введіть елементи списку через пробіл: ").split()))

    print("Початковий список:", A)

    k = int(input("Введіть порядковий номер елемента для розбиття: "))

    while k < 0 or k > len(A):
        k = int(input("Помилка. Введіть номер від 0 до довжини списку: "))

    list1 = A[:k]
    list2 = A[k:]

    print("Перший список:", list1)
    print("Другий список:", list2)

    return list1, list2

split_list()
